[
  {
    "id": "S001",
    "name": "Stranger Things",
    "seasons": 4,
    "rating": 8.7,
    "year": 2016,
    "description": "In the 1980s town of Hawkins, Indiana, a young boy mysteriously disappears, prompting his friends and family to uncover a secret government experiment and a dark parallel dimension called the Upside Down. As supernatural forces threaten their lives, the group must confront terrifying creatures, hidden conspiracies, and the strength of friendship in the face of unimaginable danger.",
    "networkId": "N001",
    "minAge": 16,
    "status": "Ongoing",
    "language": "English",
    "genres": ["Sci-Fi", "Horror", "Mystery"],
    "cast": ["Millie Bobby Brown", "Finn Wolfhard", "Winona Ryder"],
    "image": ""
  },
  {
    "id": "S002",
    "name": "You",
    "seasons": 4,
    "rating": 8.3,
    "year": 2018,
    "description": "Joe Goldberg, a seemingly charming and intelligent bookstore manager, becomes dangerously obsessed with women he encounters. Using social media, surveillance, and psychological manipulation, he inserts himself into their lives under the guise of love, revealing the dark and often terrifying extremes of obsession and the moral dilemmas of human behavior.",
    "networkId": "N001",
    "minAge": 18,
    "status": "Ongoing",
    "language": "English",
    "genres": ["Psychological Thriller", "Crime", "Drama"],
    "cast": ["Penn Badgley", "Victoria Pedretti"],
    "image": ""
  },
  {
    "id": "S003",
    "name": "Blood & Water",
    "seasons": 3,
    "rating": 6.6,
    "year": 2020,
    "description": "When a South African teen transfers to an elite boarding school, she becomes determined to uncover the truth about her long-lost sister, who disappeared years earlier. Navigating a world of privilege, lies, and teenage rivalry, she encounters friends and foes while confronting family secrets that challenge everything she thought she knew about herself.",
    "networkId": "N001",
    "minAge": 16,
    "status": "Ongoing",
    "language": "English",
    "genres": ["Drama", "Mystery", "Teen"],
    "cast": ["Ama Qamata", "Khosi Ngema"],
    "image": ""
  },
  {
    "id": "S004",
    "name": "How to Get Away with Murder",
    "seasons": 6,
    "rating": 8.1,
    "year": 2014,
    "description": "Brilliant criminal defense professor Annalise Keating teaches law students the intricacies of the legal system, but their lives become entangled in murder cases and dangerous secrets. Each season explores moral ambiguity, deception, and the consequences of crime, revealing how far people will go to protect themselves and those they love.",
    "networkId": "N004",
    "minAge": 16,
    "status": "Ended",
    "language": "English",
    "genres": ["Crime", "Drama", "Mystery"],
    "cast": ["Viola Davis", "Alfred Enoch", "Jack Falahee"],
    "image": ""
  },
  {
    "id": "S005",
    "name": "Snowfall",
    "seasons": 6,
    "rating": 8.3,
    "year": 2017,
    "description": "Set in 1980s Los Angeles, 'Snowfall' chronicles the early days of the crack cocaine epidemic and its impact on culture, crime, and the economy. Following multiple intertwined characters, including ambitious drug dealers, law enforcement, and families caught in the chaos, the series paints a gripping portrait of ambition, survival, and the societal consequences of addiction.",
    "networkId": "N002",
    "minAge": 18,
    "status": "Ended",
    "language": "English",
    "genres": ["Crime", "Drama"],
    "cast": ["Damson Idris", "Carter Hudson"],
    "image": ""
  },
  {
    "id": "S006",
    "name": "Gossip Girl",
    "seasons": 6,
    "rating": 7.5,
    "year": 2007,
    "description": "In New York's elite Upper East Side, teenagers navigate love, betrayal, and social hierarchies, all while being observed by the anonymous online blogger known as Gossip Girl. Through romantic entanglements, rivalries, and scandal, the series exposes the pressures of privilege, the cost of secrets, and the complicated nature of growing up under scrutiny.",
    "networkId": "N004",
    "minAge": 16,
    "status": "Ended",
    "language": "English",
    "genres": ["Drama", "Teen"],
    "cast": ["Blake Lively", "Leighton Meester", "Penn Badgley"],
    "image": ""
  },
  {
    "id": "S007",
    "name": "Euphoria",
    "seasons": 2,
    "rating": 8.4,
    "year": 2019,
    "description": "Euphoria follows a group of high school students as they navigate the complex realities of modern adolescence. Themes of love, addiction, identity, trauma, and friendship are explored through intense storytelling, stylistic visuals, and compelling performances, providing an unflinching look at the challenges and triumphs of teenage life.",
    "networkId": "N002",
    "minAge": 18,
    "status": "Ongoing",
    "language": "English",
    "genres": ["Drama", "Teen", "Psychological"],
    "cast": ["Zendaya", "Hunter Schafer", "Jacob Elordi"],
    "image": ""
  },
  {
    "id": "S008",
    "name": "Squid Game",
    "seasons": 1,
    "rating": 8.0,
    "year": 2021,
    "description": "Hundreds of financially desperate individuals accept a mysterious invitation to compete in a series of children's games, unaware that losing means death. As players vie for a life-changing cash prize, alliances, betrayals, and the darkest aspects of human nature emerge, revealing a brutal critique of society and inequality.",
    "networkId": "N001",
    "minAge": 18,
    "status": "Ongoing",
    "language": "Korean",
    "genres": ["Thriller", "Drama", "Survival"],
    "cast": ["Lee Jung-jae", "Park Hae-soo", "HoYeon Jung"],
    "image": ""
  },
  {
    "id": "S009",
    "name": "Love Island",
    "seasons": 10,
    "rating": 5.3,
    "year": 2015,
    "description": "Singles live together in a luxury villa under constant surveillance, forming romantic relationships while competing in challenges to win both love and a cash prize. The series blends drama, humor, and romance, showcasing the unpredictable dynamics of attraction, jealousy, and strategic gameplay in a social experiment-like setting.",
    "networkId": "N003",
    "minAge": 16,
    "status": "Ongoing",
    "language": "English",
    "genres": ["Reality", "Romance"],
    "cast": ["Maya Jama", "Iain Stirling"],
    "image": ""
  },
  {
    "id": "A001",
    "name": "Attack on Titan",
    "seasons": 4,
    "rating": 9.0,
    "year": 2013,
    "description": "In a world where humanity is trapped behind massive walls to protect themselves from man-eating Titans, young soldier Eren Yeager vows to uncover the truth about these monsters and reclaim freedom for mankind. The series explores survival, sacrifice, political intrigue, and the psychological toll of constant warfare, all wrapped in epic action and emotional storytelling.",
    "networkId": "N005",
    "minAge": 16,
    "status": "Ended",
    "language": "Japanese",
    "genres": ["Action", "Drama", "Fantasy"],
    "cast": ["Yuki Kaji", "Marina Inoue", "Yui Ishikawa"],
    "image": ""
  },
  {
    "id": "A002",
    "name": "Death Note",
    "seasons": 1,
    "rating": 9.0,
    "year": 2006,
    "description": "High school student Light Yagami discovers a supernatural notebook that allows him to kill anyone by writing their name in it. As he attempts to create a utopia free of crime, a genius detective known as L begins a high-stakes game of cat and mouse, exploring morality, justice, and the corruption of power.",
    "networkId": "N005",
    "minAge": 16,
    "status": "Ended",
    "language": "Japanese",
    "genres": ["Mystery", "Thriller", "Supernatural"],
    "cast": ["Mamoru Miyano", "Kappei Yamaguchi", "Aya Hirano"],
    "image": ""
  },
  {
    "id": "A003",
    "name": "Solo Leveling",
    "seasons": 1,
    "rating": 8.5,
    "year": 2024,
    "description": "In a world plagued by dungeons and monsters, a weak hunter named Sung Jin-Woo discovers a mysterious ability to level up in strength. As he grows stronger, he faces increasingly dangerous challenges, uncovers hidden conspiracies, and becomes humanity's most powerful protector, all while navigating a complex web of politics, rivalries, and mythical threats.",
    "networkId": "N005",
    "minAge": 16,
    "status": "Ongoing",
    "language": "Korean",
    "genres": ["Action", "Fantasy", "Adventure"],
    "cast": ["Choi Seong-hoon", "Lee Sung-joon"],
    "image": ""
  }
]
